; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_8_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 - counter
	)
  (:init
		(= (value c0) 34)
	(= (value c1) 59)
	(= (value c2) 32)
	(= (value c3) 49)
	(= (value c4) 68)
	(= (value c5) 35)
	(= (value c6) 15)
	(= (value c7) 2)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 7
2. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 3 of 7
3. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 3 of 7
4. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 7
5. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 3 of 7
6. (decrement_rate c6)
   changed: (rate_value c6) from 1 to 0
   goals met: 3 of 7
7. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 3 of 7
8. (increment c7)
   changed: (value c7) from 2 to 6
   goals met: 3 of 7
9. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 3 of 7
10. (increment c7)
   changed: (value c7) from 6 to 11
   goals met: 3 of 7
11. (increment c7)
   changed: (value c7) from 11 to 16
   goals met: 4 of 7
12. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 4 of 7
13. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 4 of 7
14. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 4 of 7
15. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 4 of 7
16. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 4 of 7
17. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 4 of 7
18. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 4 of 7
19. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 4 of 7
20. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 4 of 7
21. (increase_rate c5)
   changed: (rate_value c5) from 5 to 6
   goals met: 4 of 7
22. (increase_rate c5)
   changed: (rate_value c5) from 6 to 7
   goals met: 4 of 7
23. (increment c5)
   changed: (value c5) from 35 to 42
   goals met: 4 of 7
24. (increase_rate c6)
   changed: (rate_value c6) from 5 to 6
   goals met: 4 of 7
25. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 4 of 7
26. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 4 of 7
27. (increase_rate c6)
   changed: (rate_value c6) from 6 to 7
   goals met: 4 of 7
28. (increment c6)
   changed: (value c6) from 15 to 22
   goals met: 3 of 7
29. (increment c5)
   changed: (value c5) from 42 to 49
   goals met: 3 of 7
30. (increment c7)
   changed: (value c7) from 16 to 21
   goals met: 3 of 7
31. (increment c7)
   changed: (value c7) from 21 to 26
   goals met: 4 of 7
32. (increment c6)
   changed: (value c6) from 22 to 29
   goals met: 3 of 7
33. (increment c6)
   changed: (value c6) from 29 to 36
   goals met: 3 of 7
34. (increase_rate c5)
   changed: (rate_value c5) from 7 to 8
   goals met: 3 of 7
35. (increase_rate c5)
   changed: (rate_value c5) from 8 to 9
   goals met: 3 of 7
36. (increase_rate c5)
   changed: (rate_value c5) from 9 to 10
   goals met: 3 of 7
37. (increment c5)
   changed: (value c5) from 49 to 59
   goals met: 3 of 7
38. (increment c5)
   changed: (value c5) from 59 to 69
   goals met: 4 of 7
39. (increase_rate c6)
   changed: (rate_value c6) from 7 to 8
   goals met: 4 of 7
40. (increase_rate c6)
   changed: (rate_value c6) from 8 to 9
   goals met: 4 of 7
41. (increase_rate c6)
   changed: (rate_value c6) from 9 to 10
   goals met: 4 of 7
42. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 4 of 7
43. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 4 of 7
44. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 4 of 7
45. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 4 of 7
46. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 4 of 7
47. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 4 of 7
48. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 4 of 7
49. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 4 of 7
50. (increment c2)
   changed: (value c2) from 32 to 37
   goals met: 4 of 7
51. (increment c2)
   changed: (value c2) from 37 to 42
   goals met: 4 of 7
52. (increment c2)
   changed: (value c2) from 42 to 47
   goals met: 4 of 7
53. (increment c2)
   changed: (value c2) from 47 to 52
   goals met: 3 of 7
54. (increment c7)
   changed: (value c7) from 26 to 31
   goals met: 3 of 7
55. (increment c7)
   changed: (value c7) from 31 to 36
   goals met: 3 of 7
56. (increment c7)
   changed: (value c7) from 36 to 41
   goals met: 4 of 7
57. (decrement c2)
   changed: (value c2) from 52 to 47
   goals met: 5 of 7
58. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 5 of 7
59. (decrement c1)
   changed: (value c1) from 59 to 55
   goals met: 5 of 7
60. (increment c2)
   changed: (value c2) from 47 to 52
   goals met: 4 of 7
61. (decrement c1)
   changed: (value c1) from 55 to 51
   goals met: 5 of 7
62. (decrement c2)
   changed: (value c2) from 52 to 47
   goals met: 5 of 7
63. (decrement c1)
   changed: (value c1) from 51 to 47
   goals met: 5 of 7
64. (decrement c1)
   changed: (value c1) from 47 to 43
   goals met: 6 of 7
65. (increment c6)
   changed: (value c6) from 36 to 46
   goals met: 5 of 7
66. (increment c7)
   changed: (value c7) from 41 to 46
   goals met: 5 of 7
67. (increment c7)
   changed: (value c7) from 46 to 51
   goals met: 6 of 7
68. (increment c6)
   changed: (value c6) from 46 to 56
   goals met: 5 of 7
69. (increment c7)
   changed: (value c7) from 51 to 56
   goals met: 5 of 7
70. (increment c7)
   changed: (value c7) from 56 to 61
   goals met: 6 of 7
71. (increment c6)
   changed: (value c6) from 56 to 66
   goals met: 5 of 7
72. (increment c7)
   changed: (value c7) from 61 to 66
   goals met: 5 of 7
73. (increment c7)
   changed: (value c7) from 66 to 71
   goals met: 6 of 7
74. (increment c6)
   changed: (value c6) from 66 to 76
   goals met: 6 of 7
75. (increment c7)
   changed: (value c7) from 71 to 76
   goals met: 6 of 7
76. (increment c7)
   changed: (value c7) from 76 to 81
   goals met: 7 of 7
